{"config": {"layers": [{"config": {"batch_input_shape": [null, 64, 64, 3], "ragged": false, "sparse": false, "name": "conv2d_32_input", "dtype": "float32"}, "class_name": "InputLayer"}, {"config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "conv2d_32", "dtype": "float32", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null}, "class_name": "HeNormal"}, "batch_input_shape": [null, 64, 64, 3], "groups": 1, "kernel_regularizer": null, "filters": 32, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_35", "center": true, "dtype": "float32", "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "epsilon": 0.001, "axis": [3], "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_20", "dtype": "float32"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "conv2d_33", "dtype": "float32", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null}, "class_name": "HeNormal"}, "groups": 1, "kernel_regularizer": null, "filters": 32, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_36", "center": true, "dtype": "float32", "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "epsilon": 0.001, "axis": [3], "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_21", "dtype": "float32"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_22", "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "conv2d_34", "dtype": "float32", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null}, "class_name": "HeNormal"}, "groups": 1, "kernel_regularizer": null, "filters": 64, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_37", "center": true, "dtype": "float32", "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "epsilon": 0.001, "axis": [3], "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_22", "dtype": "float32"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "conv2d_35", "dtype": "float32", "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null}, "class_name": "HeNormal"}, "groups": 1, "kernel_regularizer": null, "filters": 64, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "batch_normalization_38", "center": true, "dtype": "float32", "beta_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "trainable": true, "gamma_regularizer": null, "epsilon": 0.001, "axis": [3], "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_23", "dtype": "float32"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_23", "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_8", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 512, "name": "dense_16", "dtype": "float32", "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "HeNormal"}, "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "seed": null, "name": "dropout_8", "dtype": "float32", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 1, "name": "dense_17", "dtype": "float32", "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "HeNormal"}, "kernel_constraint": null, "activation": "sigmoid", "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}], "name": "sequential_5"}, "backend": "tensorflow", "keras_version": "2.4.0", "class_name": "Sequential"}